validation/rhoBoxDF/constant/fvOptions
FoamFile { version 2.0; format ascii; class dictionary; object fvOptions; }

porosity
{
    type            explicitPorositySource;
    active          yes;
    explicitPorositySourceCoeffs
    {
        type            DarcyForchheimer;
        selectionMode   cellZone;
        cellZone        plug;
        DarcyForchheimerCoeffs
        {
            d   (1e7 1e7 1e7);
            f   (40 40 40);
            coordinateSystem
            {
                origin  (0 0 0);
                rotation { type axesRotation; e1 (1 0 0); e2 (0 1 0); }
            }
        }
    }
}
