validation/rhoBoxDF/system/topoSetDict
FoamFile { version 2.0; format ascii; class dictionary; object topoSetDict; }
actions
(
    { name plugCells; type cellSet;  action new; source boxToCell; box (0.8 -1 -1) (1.2 1 1); }
    { name plug;      type cellZoneSet; action new; source setToCellZone; set plugCells; }
);
